chat_desc= {
    "CHAT_SELECT_BABY": {
        "name": "Чат для родителей детей, рожде‌нных раньше срока ( до 1,5 лет )",
        "desc": "В группе информационная и психологическая помощь родителям по любым вопросам, связанным с недоношенными детьми."
    },
    "CHAT_SELECT_CHILD": {
        "name": "Чат для родителей детей, рожде‌нных раньше срока ( от 1,5 лет и старше )",
        "desc": "В группе информационная и психологическая помощь родителям по любым вопросам, связанным с недоношенными детьми."
    },
    "CHAT_SELECT_RETINOPATIA": {
        "name": "Чат \"Ретинопатия\"",
        "desc": "Группа для родителей деток с ретинопатией"
    },
    "CHAT_SELECT_SHUNTATA": {
        "name": "Чат \"Шунтята\".",
        "desc": "Группа для родителей деток с шунтами."
    },
    "CHAT_SELECT_GRANDMOTHERS": {
        "name": "Чат \"Бабушки торопыжек\".",
        "desc": "Бабушки хотят помочь своим детям, внукам, но не знают как. При этом, сами нуждаются в поддержке!"
                "Именно поэтому, создана группа взаимной поддержки бабушек недоношенных детей."
    },
    "CHAT_SELECT_CRY": {
        "name": "Чат \"Отвести душу и поплакать\"",
        "desc": "Иногда очень хочется пожаловаться и поплакать."
                "Ведь вокруг так много несправедливости! ЧАТ психологической направленности."
                "В чате всегда готовы помочь Вам профессиональные психологи и, конечно, мамы."
    },
    "CHAT_SELECT_ANGELS": {
        "name": "Чат \"Мамы ангелов\".",
        "desc": "Для родителей, которые столкнулись со смертью ребенка."
    },
    "CHAT_SELECT_RETINOPATIA_4_5": {
        "name": "Чат \"Ретинопатия недоношеных 4-5 стадии\"",
        "desc": " "
    },
    "CHAT_SELECT_PROBLEMS": {
        "name": "Чат \"Зрение детей с различными офтальмологическими проблемами\"",
        "desc": "(включая косоглазие)"
    },
    "CHAT_SELECT_REHABILITATION": {
        "name": "Чат \"Реабилитация зрения\"",
        "desc": " "
    },
    "CHAT_SELECT_TELEGRAM": {
        "name": "Группа поддержки в Телеграмм «Помощь семьям торопыжек»",
        "desc": "t.me/toropizhki"
    },
}

fund_desc= {
    "FOND_SELECT_LOOKWORLD": {
        "name": "Смотри на мир",
        "desc": "111"
    },
    "FOND_SELECT_REHABILITATION": {
        "name": "Реабилитация",
        "desc": "222"
    },
    "FOND_SELECT_PSYHELP": {
        "name": "Психологическая помощь",
        "desc": "333"
    },
    "FOND_SELECT_LESSONS": {
        "name": "Уроки.",
        "desc": "444"
    },
}

link_desc = {
    "TELL_WEBPAGE": {
        "name": "Страница в интернете",
        "desc": " на страницу в интернете",
        "link": "http://www."
    },
    "TELL_VK": {
        "name": "ВКонтакте",
        "desc": " на страницу ВКонтакте",
        "link": "http://www.vk.ru"
    },
    "TELL_INSTA": {
        "name": "Instagram",
        "desc": " на страницу в Instagram",
        "link": "http://www."
    },
    "TELL_FACEBOOK": {
        "name": "Facebook",
        "desc": " на страницу в Facebook",
        "link": "http://www.facebook.com"
    },
    "TELL_CHAT": {
        "name": "Чат",
        "desc": " в чат",
        "link": "http://www."
    },
    "TELL_TELEGRAM": {
        "name": "Telegam",
        "desc": " в telegram",
        "link": "http://www.telegram.com"
    },
}
