from bot.constants.keys import SELECT

CHAT_MENU = {
    f"{SELECT}_BABY": {
        "name": "Дети, рожде‌нные раньше срока (до 1,5 лет)",
        "desc": ("В группе для родителей детей, рожде‌нных раньше срока, "
                 "информационная и психологическая помощь родителям по любым "
                 "вопросам, связанным с недоношенными детьми младше 1,5 лет. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_CHILD": {
        "name": "Дети, рожде‌нные раньше срока (старше 1,5 лет)",
        "desc": ("В группе для родителей детей, рожде‌нных раньше срока, "
                 "информационная и психологическая помощь родителям по любым "
                 "вопросам, связанным с недоношенными детьми старше 1,5 лет. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_RETINOPATIA": {
        "name": "Дети с ретинопатией",
        "desc": ("Группа для родителей деток с ретинопатией. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_SHUNTATA": {
        "name": "Шунтята",
        "desc": ("Группа для родителей деток с шунтами. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_GRANDMOTHERS": {
        "name": "Бабушки торопыжек",
        "desc": ("Группа для бабушек. Бабушки хотят помочь своим детям, "
                 "внукам, но не знают как. При этом, сами нуждаются в поддержке! "
                 "Именно поэтому, создана группа взаимной поддержки бабушек недоношенных детей. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_CRY": {
        "name": "Отвести душу и поплакать",
        "desc": ("Иногда очень хочется пожаловаться и поплакать. "
                 "Ведь вокруг так много несправедливости! Чат психологической направленности. "
                 "В чате всегда готовы помочь Вам профессиональные психологи и, конечно, мамы. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_ANGELS": {
        "name": "Мамы ангелов.",
        "desc": ("Чат для родителей, которые столкнулись со смертью ребенка. "
                 "Для вступления в чат Вам необходимо предоставить свое имя и телефон.")
    },
    f"{SELECT}_RETINOPATIA_4_5": {
        "name": "Ретинопатия недоношеных 4-5 стадии",
        "desc": ("Чат для родителей детей с ретинопатией недоношенных 4-5 стадии. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_PROBLEMS": {
        "name": "Дети с офтальмологическими проблемами",
        "desc": ("Чат для родителей детей с различными офтальмологическими проблемами "
                 "(включая косоглазие). Для вступления в чат Вам необходимо предоставить "
                 "информацию для куратора.")
    },
    f"{SELECT}_REHABILITATION": {
        "name": "Реабилитация зрения",
        "desc": ("Чат для родителей детей, нуждающихся в реабилитации зрения. "
                 "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{SELECT}_TELEGRAM": {
        "name": "Семьи торопыжек",
        "desc": ("Группа поддержки в Телеграмм «Помощь семьям торопыжек» t.me/toropizhki. "
                 "Для вступления в группу Вам необходимо предоставить информацию для куратора.")
    },
}

FOND_MENU = {
    f"{SELECT}_LOOKWORLD": {
        "name": "Смотри на мир",
        "desc": "Описание программы 'Смотри на мир'."
    },
    f"{SELECT}_REHABILITATION": {
        "name": "Реабилитация",
        "desc": "Описание программы 'Реабилитация'."
    },
    f"{SELECT}_PSYHELP": {
        "name": "Психологическая помощь",
        "desc": "Описание программы 'Психологическая помощь'."
    },
    f"{SELECT}_LESSONS": {
        "name": "Добрые уроки",
        "desc": "Описание программы 'Добрые уроки'."
    },
}
