from bot.constants.key import SELECT


CHAT_MENU = {
    f"{SELECT}_BABY": {
        "name": "Для рожде‌нных раньше срока (до 1,5 лет)",
        "desc": "В группе информационная и психологическая помощь родителям по любым вопросам, связанным с недоношенными детьми."
    },
    f"{SELECT}_CHILD": {
        "name": "Для рожде‌нных раньше срока (от 1,5 лет)",
        "desc": "В группе информационная и психологическая помощь родителям по любым вопросам, связанным с недоношенными детьми."
    },
    f"{SELECT}_RETINOPATIA": {
        "name": "Ретинопатия",
        "desc": "Группа для родителей деток с ретинопатией"
    },
    f"{SELECT}_SHUNTATA": {
        "name": "Шунтята",
        "desc": "Группа для родителей деток с шунтами."
    },
    f"{SELECT}_GRANDMOTHERS": {
        "name": "Бабушки торопыжек",
        "desc": "Бабушки хотят помочь своим детям, внукам, но не знают как. При этом, сами нуждаются в поддержке!"
                "Именно поэтому, создана группа взаимной поддержки бабушек недоношенных детей."
    },
    f"{SELECT}_CRY": {
        "name": "Отвести душу и поплакать",
        "desc": "Иногда очень хочется пожаловаться и поплакать."
                "Ведь вокруг так много несправедливости! ЧАТ психологической направленности."
                "В чате всегда готовы помочь Вам профессиональные психологи и, конечно, мамы."
    },
    f"{SELECT}_ANGELS": {
        "name": "Мамы ангелов.",
        "desc": "Для родителей, которые столкнулись со смертью ребенка."
    },
    f"{SELECT}_RETINOPATIA_4_5": {
        "name": "Ретинопатия недоношеных 4-5 стадии",
        "desc": " "
    },
    f"{SELECT}_PROBLEMS": {
        "name": "Зрение детей с различными офтальмологическими проблемами",
        "desc": "(включая косоглазие)"
    },
    f"{SELECT}_REHABILITATION": {
        "name": "Реабилитация зрения",
        "desc": "123"
    },
    f"{SELECT}_TELEGRAM": {
        "name": "Группа поддержки в Телеграмм «Помощь семьям торопыжек»",
        "desc": "t.me/toropizhki"
    },
}

FOND_MENU = {
    f"{SELECT}_LOOKWORLD": {
        "name": "Смотри на мир XXX",
        "desc": "111"
    },
    f"{SELECT}_REHABILITATION": {
        "name": "Реабилитация",
        "desc": "222"
    },
    f"{SELECT}_PSYHELP": {
        "name": "Психологическая помощь",
        "desc": "333"
    },
    f"{SELECT}_LESSONS": {
        "name": "Уроки",
        "desc": "444"
    },
}