from bot.constants import key

CHAT_MENU = {
    f"{key.SELECT}_BABY": {
        key.BUTTON_TEXT: "Дети, рожде‌нные раньше срока (до 1,5 лет)",
        key.DESCRIPTION: ("В группе для родителей детей, рожде‌нных раньше срока, "
                          "информационная и психологическая помощь родителям по любым "
                          "вопросам, связанным с недоношенными детьми младше 1,5 лет. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_CHILD": {
        key.BUTTON_TEXT: "Дети, рожде‌нные раньше срока (старше 1,5 лет)",
        key.DESCRIPTION: ("В группе для родителей детей, рожде‌нных раньше срока, "
                          "информационная и психологическая помощь родителям по любым "
                          "вопросам, связанным с недоношенными детьми старше 1,5 лет. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_RETINOPATIA": {
        key.BUTTON_TEXT: "Дети с ретинопатией",
        key.DESCRIPTION: ("Группа для родителей деток с ретинопатией. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_SHUNTATA": {
        key.BUTTON_TEXT: "Шунтята",
        key.DESCRIPTION: ("Группа для родителей деток с шунтами. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_GRANDMOTHERS": {
        key.BUTTON_TEXT: "Бабушки торопыжек",
        key.DESCRIPTION: ("Группа для бабушек. Бабушки хотят помочь своим детям, "
                          "внукам, но не знают как. При этом, сами нуждаются в поддержке! "
                          "Именно поэтому, создана группа взаимной поддержки бабушек недоношенных детей. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_CRY": {
        key.BUTTON_TEXT: "Отвести душу и поплакать",
        key.DESCRIPTION: ("Иногда очень хочется пожаловаться и поплакать. "
                          "Ведь вокруг так много несправедливости! Чат психологической направленности. "
                          "В чате всегда готовы помочь Вам профессиональные психологи и, конечно, мамы. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_ANGELS": {
        key.BUTTON_TEXT: "Мамы ангелов.",
        key.DESCRIPTION: ("Чат для родителей, которые столкнулись со смертью ребенка. "
                          "Для вступления в чат Вам необходимо предоставить свое имя и телефон.")
    },
    f"{key.SELECT}_RETINOPATIA_4_5": {
        key.BUTTON_TEXT: "Ретинопатия недоношеных 4-5 стадии",
        key.DESCRIPTION: ("Чат для родителей детей с ретинопатией недоношенных 4-5 стадии. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_PROBLEMS": {
        key.BUTTON_TEXT: "Дети с офтальмологическими проблемами",
        key.DESCRIPTION: ("Чат для родителей детей с различными офтальмологическими проблемами "
                          "(включая косоглазие). Для вступления в чат Вам необходимо предоставить "
                          "информацию для куратора.")
    },
    f"{key.SELECT}_REHABILITATION": {
        key.BUTTON_TEXT: "Реабилитация зрения",
        key.DESCRIPTION: ("Чат для родителей детей, нуждающихся в реабилитации зрения. "
                          "Для вступления в чат Вам необходимо предоставить информацию для куратора.")
    },
    f"{key.SELECT}_TELEGRAM": {
        key.BUTTON_TEXT: "Семьи торопыжек",
        key.DESCRIPTION: ("Группа поддержки в Телеграмм «Помощь семьям торопыжек» t.me/toropizhki. "
                          "Для вступления в группу Вам необходимо предоставить информацию для куратора.")
    },
}

FOND_MENU = {
    f"{key.SELECT}_LOOKWORLD": {
        key.BUTTON_TEXT: "Смотри на мир",
        key.DESCRIPTION: "Описание программы 'Смотри на мир'."
    },
    f"{key.SELECT}_REHABILITATION": {
        key.BUTTON_TEXT: "Реабилитация",
        key.DESCRIPTION: "Описание программы 'Реабилитация'."
    },
    f"{key.SELECT}_PSYHELP": {
        key.BUTTON_TEXT: "Психологическая помощь",
        key.DESCRIPTION: "Описание программы 'Психологическая помощь'."
    },
    f"{key.SELECT}_LESSONS": {
        key.BUTTON_TEXT: "Добрые уроки",
        key.DESCRIPTION: "Описание программы 'Добрые уроки'."
    },
}
