
SHORT_QUESTIONS = {
    "FULL_NAME": {
        "name": "ФИО",
        "text": "Введите фамилию, имя и отчество",
        "hint": "подсказка",
    },
    "PHONE": {
        "name": "Номер телефона",
        "text": "Введите свой контактный номер телефона",
        "hint": "подсказка",
    },
    "EMAIL": {
        "name": "Email",
        "text": "Введите email",
        "hint": "подсказка",
    },
}

VOLUNTEER_QUESTIONS = {
    **SHORT_QUESTIONS,
    "BIRTHDAY": {
        "name": "День рождения",
        "text": "Введите дату своего рождения (ДД.ММ.ГГГГ)",
        "hint": "подсказка",
    },
    "CITY": {
        "name": "Город",
        "text": "Введите город проживания",
        "hint": "подсказка",
    },
    "VOLUNTEER_HELP": {
        "name": "Предлагаемая помощь",
        "text": ("Вы можете предложить свой вариант помощи (необязательно). "
                 "Нажмите /skip чтобы пропустить."),
        "hint": "подсказка",
    },
}

ASK_QUESTIONS = {
    **SHORT_QUESTIONS,
    "QUESTION": {
        "name": "Вопрос",
        "text": "Введите Ваш вопрос",
        "hint": "подсказка",
    },
}

LONG_QUESTIONS = {
    "PARENT_FULL_NAME": {
        "name": "ФИО родителя",
        "text": "Введите фамилию, имя и отчество родителя",
        "hint": "подсказка",
    },
    "PHONE": {
        "name": "Номер телефона",
        "text": "Введите свой контактный номер телефона",
        "hint": "подсказка",
    },
    "CHILD_FULL_NAME": {
        "name": "ФИО ребенка",
        "text": "Введите фамилию, имя и отчество ребенка",
        "hint": "подсказка",
    },
    "CHILD_BIRTHDAY": {
        "name": "Дата рождения ребенка",
        "text": "Введите дату рождения ребенка",
        "hint": "подсказка",
    },
    "CHILD_BIRTH_PLACE": {
        "name": "Место рождения ребенка",
        "text": "Введите место рождения ребенка",
        "hint": "подсказка",
    },
    "CHILD_BIRTH_DATE": {
        "name": "Срок беременности при рождении ребенка",
        "text": "Введите срок беременности при рождении ребенка",
        "hint": "подсказка",
    },
    "CHILD_BIRTH_WEIGHT": {
        "name": "Вес ребенка при рождении",
        "text": "Введите вес ребенка при рождении (в гр)",
        "hint": "подсказка",
    },
    "CHILD_BIRTH_HEIGHT": {
        "name": "Рост ребенка",
        "text": "Введите рост ребенка при рождении (в см)",
        "hint": "подсказка",
    },
    "CHILD_DIAGNOSIS": {
        "name": "Диагноз ребенка",
        "text": "Введите диагнозы ребенка (через запятую при наличии нескольких)",
        "hint": "подсказка",
    },
    "WHERE_GOT_INFO": {
        "name": "Как узнали о фонде",
        "text": "Как Вы узнали о фонде?",
        "hint": "подсказка",
    },
}

CHAT_QUESTIONS = {
    **LONG_QUESTIONS,
    "OPERATION": {
        "name": "Информацию об операциях",
        "text": "Были ли проведены операции? Дата и место операций?",
        "hint": "подсказка",
    },
}

FUND_QUESTIONS = {
    **LONG_QUESTIONS,
    "EMAIL": {
        "name": "Email",
        "text": "Введите email",
        "hint": "подсказка",
    },
    "FAMILY_MEMBERS": {
        "name": "Количество членов семьи",
        "text": "Введите количество членов семьи",
        "hint": "подсказка",
    },
    "CITY": {
        "name": "Город",
        "text": "Введите город проживания",
        "hint": "подсказка",
    },
    "ADDRESS": {
        "name": "Адрес",
        "text": "Введите адрес проживания",
        "hint": "подсказка",
    },
    "ANOTHER_FUND_MEMBER": {
        "name": "Состоите ли в другом фонде",
        "text": ("Состоите ли вы в данный момент в каком-либо фонде? "
                 "Если да, то напишите название фонда"),
        "hint": "подсказка",
    },
    "ANOTHER_FUND_HELP": {
        "name": "Помогали ли другие фонды",
        "text": "Вам помогали фонды раньше? Если да, то какие?",
        "hint": "подсказка",
    },
}

ALL_QUESTIONS = {
    **VOLUNTEER_QUESTIONS,
    **ASK_QUESTIONS,
    **CHAT_QUESTIONS,
    **FUND_QUESTIONS
}
